src/InformationRegisters/КомментарииАктовРассмотренияВозврата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КомментарииАктовРассмотренияВозврата</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АктРассмотренияВозврата</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктРассмотренияВозврата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КомментарииАктовРассмотренияВозврата/Ext/ManagerModule.bsl
Процедура ДобавитьКомментарий(АктРассмотренияВозврата, ТекстКомментария, Знач Пользователь = Неопределено, Знач ПериодЗаписи = Неопределено) Экспорт

	лКлючАлгоритма = "РегистрСведений_МодульМенеджера_ДобавитьКомментарий";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Если Не ЗначениеЗаполнено(АктРассмотренияВозврата) 
		ИЛИ НЕ ЗначениеЗаполнено(СокрЛП(ТекстКомментария)) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ПериодЗаписи) Тогда
		ПериодЗаписи = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ Первые 1
		|	МАКСИМУМ(КомментарииАктовРассмотренияВозврата.Период) КАК ПериодМакс,
		|	КомментарииАктовРассмотренияВозврата.Период,
		|	КомментарииАктовРассмотренияВозврата.АктРассмотренияВозврата,
		|	КомментарииАктовРассмотренияВозврата.Пользователь
		|ИЗ
		|	РегистрСведений.КомментарииАктовРассмотренияВозврата КАК КомментарииАктовРассмотренияВозврата
		|ГДЕ
		|	КомментарииАктовРассмотренияВозврата.АктРассмотренияВозврата = &АктРассмотренияВозврата
		|	И КомментарииАктовРассмотренияВозврата.Пользователь = &Пользователь
		|
		|СГРУППИРОВАТЬ ПО
		|	КомментарииАктовРассмотренияВозврата.Период,
		|	КомментарииАктовРассмотренияВозврата.АктРассмотренияВозврата,
		|	КомментарииАктовРассмотренияВозврата.Пользователь
		|
		|ИМЕЮЩИЕ
		|	КомментарииАктовРассмотренияВозврата.Период = &Период";
	
	Запрос.УстановитьПараметр("АктРассмотренияВозврата", АктРассмотренияВозврата);
	Запрос.УстановитьПараметр("Период", ПериодЗаписи);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();;
	
	Если Выборка.Количество() > 0 Тогда
		ПериодЗаписи =  Выборка.ПериодМакс+1;		
	КонецЕсли;
	
	
	МЗ = РегистрыСведений.КомментарииАктовРассмотренияВозврата.СоздатьМенеджерЗаписи();
	МЗ.Период 					= ПериодЗаписи;
	МЗ.АктРассмотренияВозврата 	= АктРассмотренияВозврата;
	МЗ.Пользователь 			= Пользователь;
	МЗ.Комментарий 				= ТекстКомментария;
	МЗ.Записать();	
	
КонецПроцедуры

Функция КоличествоКомментариевПоАкту(АктРассмотренияВозврата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомментарииАктовРассмотренияВозврата.АктРассмотренияВозврата
		|ИЗ
		|	РегистрСведений.КомментарииАктовРассмотренияВозврата КАК КомментарииАктовРассмотренияВозврата
		|ГДЕ
		|	КомментарииАктовРассмотренияВозврата.АктРассмотренияВозврата = &АктРассмотренияВозврата";
	
	Запрос.УстановитьПараметр("АктРассмотренияВозврата", АктРассмотренияВозврата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка.Количество();

КонецФункции

Функция МожноУдалитьКомментарий(СтруктураПараметров) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ первые 1
		|	КомментарииАктовРассмотренияВозврата.АктРассмотренияВозврата
		|ИЗ
		|	РегистрСведений.КомментарииАктовРассмотренияВозврата КАК КомментарииАктовРассмотренияВозврата
		|ГДЕ
		|	КомментарииАктовРассмотренияВозврата.АктРассмотренияВозврата = &АктРассмотренияВозврата
		|	И КомментарииАктовРассмотренияВозврата.Период > &Период";
	
	Запрос.УстановитьПараметр("АктРассмотренияВозврата",СтруктураПараметров.АктРассмотренияВозврата);
	Запрос.УстановитьПараметр("Период", СтруктураПараметров.Период);
	Запрос.УстановитьПараметр("МинПериод", ТекущаяДата()-60*5);
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Пустой();

КонецФункции

Функция УдалитьКомментарий(СтруктураПараметров) Экспорт
	
	Если  МожноУдалитьКомментарий(СтруктураПараметров)
		И ЗначениеЗаполнено(СтруктураПараметров.Период) 
		И ЗначениеЗаполнено(СтруктураПараметров.АктРассмотренияВозврата)
		И ЗначениеЗаполнено(СтруктураПараметров.Пользователь) Тогда
		
		  НЗ = РегистрыСведений.КомментарииАктовРассмотренияВозврата.СоздатьНаборЗаписей();
		  НЗ.Отбор.Период.Установить(СтруктураПараметров.Период);
		  НЗ.Отбор.АктРассмотренияВозврата.Установить(СтруктураПараметров.АктРассмотренияВозврата);
		  НЗ.Отбор.Пользователь.Установить(СтруктураПараметров.Пользователь);
		  НЗ.Записать();
		
		
	КонецЕсли;
	

КонецФункции
